[NoCoverage] Block removal mutation
Helper/TokenHelper.cs:28:9
         private readonly UserManager<User> _userManager;
 
         public TokenHelper(IConfiguration config, UserManager<User> userManager)
-        {
-            _userManager = userManager;
-            _config = config;
-        }
+        {}
 
         public async Task<string> CreateAccessToken(User user)

[NoCoverage] Statement mutation
Helper/TokenHelper.cs:46:17
 
             foreach (var role in roles)
             {
-                claims.Add(new Claim(ClaimTypes.Role, role));
+                ;
             }
 

[NoCoverage] String mutation
Helper/TokenHelper.cs:49:45
                 claims.Add(new Claim(ClaimTypes.Role, role));
             }
 
-            var secret = _config.GetSection("Jwt").GetSection("Token").Get<String>();
+            var secret = _config.GetSection("").GetSection("Token").Get<String>();
 
             var key = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(secret));

[NoCoverage] Object initializer mutation
Helper/TokenHelper.cs:81:45
 
         public ClaimsPrincipal GetPrincipalFromExpiredToken(string _Token)
         {
-            var tokenValidationParameters = new TokenValidationParameters
-            {
-                ValidateIssuerSigningKey = true,
-                ValidateLifetime = true,
-                RequireExpirationTime = true,
-                IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_config["Jwt:Token"])),
-                ValidateIssuer = false,
-                ValidateAudience = false
-            };
+            var tokenValidationParameters = new TokenValidationParameters
+{};
             IdentityModelEventSource.ShowPII = true;
             var tokenHandler = new JwtSecurityTokenHandler();

[NoCoverage] Boolean mutation
Helper/TokenHelper.cs:84:36
             var tokenValidationParameters = new TokenValidationParameters
             {
                 ValidateIssuerSigningKey = true,
-                ValidateLifetime = true,
+                ValidateLifetime = false,
                 RequireExpirationTime = true,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_config["Jwt:Token"])),

[NoCoverage] Boolean mutation
Helper/TokenHelper.cs:85:41
             {
                 ValidateIssuerSigningKey = true,
                 ValidateLifetime = true,
-                RequireExpirationTime = true,
+                RequireExpirationTime = false,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_config["Jwt:Token"])),
                 ValidateIssuer = false,

[NoCoverage] Boolean mutation
Helper/TokenHelper.cs:87:34
                 ValidateLifetime = true,
                 RequireExpirationTime = true,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_config["Jwt:Token"])),
-                ValidateIssuer = false,
+                ValidateIssuer = true,
                 ValidateAudience = false
             };

[NoCoverage] Boolean mutation
Helper/TokenHelper.cs:90:48
                 ValidateIssuer = false,
                 ValidateAudience = false
             };
-            IdentityModelEventSource.ShowPII = true;
+            IdentityModelEventSource.ShowPII = false;
             var tokenHandler = new JwtSecurityTokenHandler();
             SecurityToken securityToken;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Helper/TokenHelper.cs:96:45
 
             var principal = tokenHandler.ValidateToken(_Token, tokenValidationParameters, out securityToken);
             var jwtSecurityToken = securityToken as JwtSecurityToken;
-            if (jwtSecurityToken == null || !jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase))
+            if (jwtSecurityToken == null || jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase))
                 throw new SecurityTokenException("Invalid token");
 

[NoCoverage] Negate expression
Helper/TokenHelper.cs:96:17
 
             var principal = tokenHandler.ValidateToken(_Token, tokenValidationParameters, out securityToken);
             var jwtSecurityToken = securityToken as JwtSecurityToken;
-            if (jwtSecurityToken == null || !jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase))
+            if (!(jwtSecurityToken == null || !jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase)))
                 throw new SecurityTokenException("Invalid token");
 

[NoCoverage] Statement mutation
Helper/TokenHelper.cs:97:17
             var principal = tokenHandler.ValidateToken(_Token, tokenValidationParameters, out securityToken);
             var jwtSecurityToken = securityToken as JwtSecurityToken;
             if (jwtSecurityToken == null || !jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase))
-                throw new SecurityTokenException("Invalid token");
+                ;
 
             return principal;

[NoCoverage] String mutation
Helper/TokenHelper.cs:97:50
             var principal = tokenHandler.ValidateToken(_Token, tokenValidationParameters, out securityToken);
             var jwtSecurityToken = securityToken as JwtSecurityToken;
             if (jwtSecurityToken == null || !jwtSecurityToken.Header.Alg.Equals("hs256", StringComparison.InvariantCultureIgnoreCase))
-                throw new SecurityTokenException("Invalid token");
+                throw new SecurityTokenException("");
 
             return principal;
