[NoCoverage] Block removal mutation
Managers/ArtistManager.cs:19:9
         private readonly IArtistRepository _artistRepository;
 
         public ArtistManager(IArtistRepository artistRepository)
-        {
-            _artistRepository = artistRepository;
-        }
+        {}
 
         public async Task<List<ArtistWithFirstNameAndLastNameModel>> Create(Artist artist)

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/ArtistManager.cs:25:22
 
         public async Task<List<ArtistWithFirstNameAndLastNameModel>> Create(Artist artist)
         {
-            var ok = _artistRepository
-                .GetAll()
-                .Where(x => x.FirstName == artist.FirstName && x.LastName == artist.LastName).FirstOrDefault();
+            var ok = _artistRepository
+                .GetAll()
+                .Where(x => x.FirstName == artist.FirstName && x.LastName == artist.LastName).First();
 
             if (ok == null)

[NoCoverage] Equality mutation
Managers/ArtistManager.cs:27:64
         {
             var ok = _artistRepository
                 .GetAll()
-                .Where(x => x.FirstName == artist.FirstName && x.LastName == artist.LastName).FirstOrDefault();
+                .Where(x => x.FirstName == artist.FirstName && x.LastName != artist.LastName).FirstOrDefault();
 
             if (ok == null)

[NoCoverage] Logical mutation
Managers/ArtistManager.cs:27:29
         {
             var ok = _artistRepository
                 .GetAll()
-                .Where(x => x.FirstName == artist.FirstName && x.LastName == artist.LastName).FirstOrDefault();
+                .Where(x => x.FirstName == artist.FirstName || x.LastName == artist.LastName).FirstOrDefault();
 
             if (ok == null)

[NoCoverage] Equality mutation
Managers/ArtistManager.cs:29:17
                 .GetAll()
                 .Where(x => x.FirstName == artist.FirstName && x.LastName == artist.LastName).FirstOrDefault();
 
-            if (ok == null)
+            if (ok != null)
             {
                 await _artistRepository.Create(artist);

[NoCoverage] Statement mutation
Managers/ArtistManager.cs:31:17
 
             if (ok == null)
             {
-                await _artistRepository.Create(artist);
+                ;
             }
 

[NoCoverage] Object initializer mutation
Managers/ArtistManager.cs:42:30
         {
             var auth = await _artistRepository
                 .GetAll()
-                .Select(x => new ArtistWithFirstNameAndLastNameModel { Id = x.Id, FirstName = x.FirstName, LastName = x.LastName }).ToListAsync();
+                .Select(x => new ArtistWithFirstNameAndLastNameModel {}).ToListAsync();
             return auth;
         }

[NoCoverage] Equality mutation
Managers/ArtistManager.cs:50:30
         {
             var info = await _artistRepository
                  .GetIncludeArtistInfo()
-                 .Where(x => x.Id == id)
+                 .Where(x => x.Id != id)
                  .Select(x => new ArtistInfoModel { Nationality = x.ArtistInfo.Nationality, BirthYear = x.ArtistInfo.BirthYear, DeathYear = x.ArtistInfo.DeathYear })
                  .FirstOrDefaultAsync();

[NoCoverage] Equality mutation
Managers/ArtistManager.cs:54:17
                  .Select(x => new ArtistInfoModel { Nationality = x.ArtistInfo.Nationality, BirthYear = x.ArtistInfo.BirthYear, DeathYear = x.ArtistInfo.DeathYear })
                  .FirstOrDefaultAsync();
 
-            if (info == null)
+            if (info != null)
             {
                 info = new ArtistInfoModel { };

[NoCoverage] Block removal mutation
Managers/ArtistManager.cs:55:13
                  .FirstOrDefaultAsync();
 
             if (info == null)
-            {
-                info = new ArtistInfoModel { };
-            }
+            {}
             return info;
         }

[NoCoverage] Statement mutation
Managers/ArtistManager.cs:63:13
 
         public async Task<List<ArtistWithFirstNameAndLastNameModel>> Update(Artist artist)
         {
-            await _artistRepository.Update(artist);
+            ;
 
             var artists = await GetAllWithoutArtistInfo();

[NoCoverage] Statement mutation
Managers/ArtistManager.cs:71:13
 
         public async Task<List<ArtistWithFirstNameAndLastNameModel>> Delete(Artist artist)
         {
-            await _artistRepository.Delete(artist);
+            ;
 
             var artists = await GetAllWithoutArtistInfo();
