[NoCoverage] Block removal mutation
Managers/AuthManager.cs:24:9
         public AuthManager(UserManager<User> userManager,
                 SignInManager<User> signInManager,
                 ITokenHelper tokenHelper)
-        {
-            _userManager = userManager;
-            _signInManager = signInManager;
-            _tokenHelper = tokenHelper;
-        }
+        {}
 
         public async Task<bool> Register(RegisterModel registerModel)

[NoCoverage] Object initializer mutation
Managers/AuthManager.cs:32:24
 
         public async Task<bool> Register(RegisterModel registerModel)
         {
-            var user = new User
-            {
-                Email = registerModel.Email,
-                UserName = registerModel.Email
-            };
+            var user = new User
+{};
 
             var result = await _userManager.CreateAsync(user, registerModel.Password);

[NoCoverage] Statement mutation
Managers/AuthManager.cs:42:17
 
             if (result.Succeeded)
             {
-                await _userManager.AddToRoleAsync(user, registerModel.Role);
+                ;
                 return true;
             }

[NoCoverage] Boolean mutation
Managers/AuthManager.cs:43:24
             if (result.Succeeded)
             {
                 await _userManager.AddToRoleAsync(user, registerModel.Role);
-                return true;
+                return false;
             }
 

[NoCoverage] Boolean mutation
Managers/AuthManager.cs:55:52
 
             if (user == null)
             {
-                return new LoginResult { Success = false };
+                return new LoginResult { Success = true };
             }
 

[NoCoverage] Boolean mutation
Managers/AuthManager.cs:58:99
                 return new LoginResult { Success = false };
             }
 
-            var result = await _signInManager.CheckPasswordSignInAsync(user, loginModel.Password, false);
+            var result = await _signInManager.CheckPasswordSignInAsync(user, loginModel.Password, true);
 
             if (result.Succeeded)

[NoCoverage] Statement mutation
Managers/AuthManager.cs:66:17
                 var refreshToken = _tokenHelper.CreateRefreshToken();
 
                 user.RefreshToken = refreshToken;
-                await _userManager.UpdateAsync(user);
+                ;
 
                 return new LoginResult

[NoCoverage] Boolean mutation
Managers/AuthManager.cs:70:31
 
                 return new LoginResult
                 {
-                    Success = true,
+                    Success = false,
                     AccessToken = token,
                     RefreshToken = refreshToken

[NoCoverage] Equality mutation
Managers/AuthManager.cs:88:17
 
             var user = await _userManager.FindByEmailAsync(username);
 
-            if (user.RefreshToken != refreshModel.RefreshToken)
+            if (user.RefreshToken == refreshModel.RefreshToken)
                 return "Invalid Token";
 
