[Killed] Block removal mutation
Managers/CartManager.cs:21:9
         private Regex regex = new Regex(@"^([\w\.\-]+)@([\w\-]+)((\.(\w){2,3})+)$");
        
         public CartManager(ICartRepository cartRepository)
-        {
-            _cartRepository = cartRepository;
-        }
+        {}
 
         public async Task AddCartToUser(string email)
killedBy: RecordShopTest.StructuralTest.UpdateSentCartNoActiveCart; RecordShopTest.StructuralTest.UpdateSentCartEmailNotFound; RecordShopTest.StructuralTest.UpdateSentCartSuccess

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/CartManager.cs:27:24
 
         public async Task AddCartToUser(string email)
         {
-            var cart = _cartRepository
-              .GetAllCarts()
-              .Where(x => x.UserEmail == email && x.Sent == 0).FirstOrDefault();
+            var cart = _cartRepository
+              .GetAllCarts()
+              .Where(x => x.UserEmail == email && x.Sent == 0).First();
 
             if (cart == null)

[NoCoverage] Equality mutation
Managers/CartManager.cs:29:51
         {
             var cart = _cartRepository
               .GetAllCarts()
-              .Where(x => x.UserEmail == email && x.Sent == 0).FirstOrDefault();
+              .Where(x => x.UserEmail == email && x.Sent != 0).FirstOrDefault();
 
             if (cart == null)

[NoCoverage] Equality mutation
Managers/CartManager.cs:29:27
         {
             var cart = _cartRepository
               .GetAllCarts()
-              .Where(x => x.UserEmail == email && x.Sent == 0).FirstOrDefault();
+              .Where(x => x.UserEmail != email && x.Sent == 0).FirstOrDefault();
 
             if (cart == null)

[NoCoverage] Equality mutation
Managers/CartManager.cs:31:17
               .GetAllCarts()
               .Where(x => x.UserEmail == email && x.Sent == 0).FirstOrDefault();
 
-            if (cart == null)
+            if (cart != null)
             {
                 cart = new Cart { Sent = 0, UserEmail = email };

[NoCoverage] Statement mutation
Managers/CartManager.cs:34:17
             if (cart == null)
             {
                 cart = new Cart { Sent = 0, UserEmail = email };
-                await _cartRepository.Create(cart);
+                ;
             }
         }

[NoCoverage] Logical mutation
Managers/CartManager.cs:42:29
         {
             var idCart = _cartRepository
                 .GetAllCarts()
-                .Where(x => x.UserEmail == email && x.Sent == 1)
+                .Where(x => x.UserEmail == email || x.Sent == 1)
                 .Select(x => x.Id)
                 .ToList();

[NoCoverage] Equality mutation
Managers/CartManager.cs:42:53
         {
             var idCart = _cartRepository
                 .GetAllCarts()
-                .Where(x => x.UserEmail == email && x.Sent == 1)
+                .Where(x => x.UserEmail == email && x.Sent != 1)
                 .Select(x => x.Id)
                 .ToList();

[NoCoverage] Linq method mutation (Sum() to Max())
Managers/CartManager.cs:51:30
 
         public PriceModel CartPrice(int cartId)
         {
-            var OrderPrice = _cartRepository.GetAllSongCartsIncludeSongAndCart()
-                .Where(x => x.Cart.Id == cartId)
-                .Sum(y => y.Song.Price * y.NoCopies);
+            var OrderPrice = _cartRepository.GetAllSongCartsIncludeSongAndCart()
+                .Where(x => x.Cart.Id == cartId)
+                .Max(y => y.Song.Price * y.NoCopies);
 
             var str = new PriceModel {

[NoCoverage] Equality mutation
Managers/CartManager.cs:52:29
         public PriceModel CartPrice(int cartId)
         {
             var OrderPrice = _cartRepository.GetAllSongCartsIncludeSongAndCart()
-                .Where(x => x.Cart.Id == cartId)
+                .Where(x => x.Cart.Id != cartId)
                 .Sum(y => y.Song.Price * y.NoCopies);
 

[NoCoverage] Arithmetic mutation
Managers/CartManager.cs:53:27
         {
             var OrderPrice = _cartRepository.GetAllSongCartsIncludeSongAndCart()
                 .Where(x => x.Cart.Id == cartId)
-                .Sum(y => y.Song.Price * y.NoCopies);
+                .Sum(y => y.Song.Price / y.NoCopies);
 
             var str = new PriceModel {

[NoCoverage] Equality mutation
Managers/CartManager.cs:71:33
             foreach (var id in ids)
             {
                 var model = _cartRepository.GetAllSongCarts()
-                    .Where(x => x.CartId == id)
+                    .Where(x => x.CartId != id)
                     .Join(_cartRepository.GetAllSongs(), b => b.SongId, a => a.Id, (b, a) =>
                      new SongCartModel

[NoCoverage] Arithmetic mutation
Managers/CartManager.cs:78:44
                          Name = a.Name,
                          Price = a.Price,
                          NoCopiesInCart = b.NoCopies,
-                         PriceOfNoCopies = a.Price * b.NoCopies
+                         PriceOfNoCopies = a.Price / b.NoCopies
                      });
 

[NoCoverage] String mutation
Managers/CartManager.cs:87:25
                 {
                     modelString = modelString + 
                         $"Song name: {str.Name}; \nPrice per cpoy: {str.Price} $;\n" +
-                        $"Number of copies purchased: {str.NoCopiesInCart}; \n" +
+                        $"" +
                         $"Price: {str.PriceOfNoCopies} $ \n";
                 }

[NoCoverage] String mutation
Managers/CartManager.cs:88:25
                     modelString = modelString + 
                         $"Song name: {str.Name}; \nPrice per cpoy: {str.Price} $;\n" +
                         $"Number of copies purchased: {str.NoCopiesInCart}; \n" +
-                        $"Price: {str.PriceOfNoCopies} $ \n";
+                        $"";
                 }
                 modelString = modelString + CartPrice(id).Price + " \n";

[NoCoverage] Statement mutation
Managers/CartManager.cs:91:17
                         $"Price: {str.PriceOfNoCopies} $ \n";
                 }
                 modelString = modelString + CartPrice(id).Price + " \n";
-                strings.Add(modelString);
+                ;
             }
 

[Killed] Negate expression
Managers/CartManager.cs:101:17
         {   
             Match match = regex.Match(email);
 
-            if (match.Success)
+            if (!(match.Success))
             {
                 var cart = _cartRepository.GetAllCarts()
killedBy: RecordShopTest.StructuralTest.UpdateSentCartSuccess

[Killed] Linq method mutation (FirstOrDefault() to First())
Managers/CartManager.cs:103:28
 
             if (match.Success)
             {
-                var cart = _cartRepository.GetAllCarts()
-                                          .Where(x => x.UserEmail == email && x.Sent == 0)
-                                          .FirstOrDefault();
+                var cart = _cartRepository.GetAllCarts()
+                                          .Where(x => x.UserEmail == email && x.Sent == 0)
+                                          .First();
 
                 if (cart != null)
killedBy: RecordShopTest.StructuralTest.UpdateSentCartNoActiveCart; RecordShopTest.StructuralTest.UpdateSentCartEmailNotFound

[Killed] Equality mutation
Managers/CartManager.cs:104:55
             if (match.Success)
             {
                 var cart = _cartRepository.GetAllCarts()
-                                          .Where(x => x.UserEmail == email && x.Sent == 0)
+                                          .Where(x => x.UserEmail != email && x.Sent == 0)
                                           .FirstOrDefault();
 
killedBy: RecordShopTest.StructuralTest.UpdateSentCartNoActiveCart; RecordShopTest.StructuralTest.UpdateSentCartEmailNotFound; RecordShopTest.StructuralTest.UpdateSentCartSuccess

[Killed] Logical mutation
Managers/CartManager.cs:104:55
             if (match.Success)
             {
                 var cart = _cartRepository.GetAllCarts()
-                                          .Where(x => x.UserEmail == email && x.Sent == 0)
+                                          .Where(x => x.UserEmail == email || x.Sent == 0)
                                           .FirstOrDefault();
 
killedBy: RecordShopTest.StructuralTest.UpdateSentCartNoActiveCart; RecordShopTest.StructuralTest.UpdateSentCartEmailNotFound

[Killed] Equality mutation
Managers/CartManager.cs:107:21
                                           .Where(x => x.UserEmail == email && x.Sent == 0)
                                           .FirstOrDefault();
 
-                if (cart != null)
+                if (cart == null)
                 {
                     cart.Sent = 1;
killedBy: RecordShopTest.StructuralTest.UpdateSentCartNoActiveCart; RecordShopTest.StructuralTest.UpdateSentCartEmailNotFound; RecordShopTest.StructuralTest.UpdateSentCartSuccess

[Survived] Statement mutation
Managers/CartManager.cs:110:21
                 if (cart != null)
                 {
                     cart.Sent = 1;
-                    _cartRepository.UpdateSongCart(cart);
+                    ;
                     return true;
                 }

[Killed] Boolean mutation
Managers/CartManager.cs:111:28
                 {
                     cart.Sent = 1;
                     _cartRepository.UpdateSongCart(cart);
-                    return true;
+                    return false;
                 }
                 else
killedBy: RecordShopTest.StructuralTest.UpdateSentCartSuccess

[Survived] Statement mutation
Managers/CartManager.cs:121:17
             }
             else
             {
-                Console.WriteLine("Not a valid email");
+                ;
                 return false;
             }

[Killed] Boolean mutation
Managers/CartManager.cs:122:24
             else
             {
                 Console.WriteLine("Not a valid email");
-                return false;
+                return true;
             }
         }
killedBy: RecordShopTest.StructuralTest.UpdateSentCartInvalidEmail
