[NoCoverage] Block removal mutation
Managers/GenreManager.cs:19:9
         private readonly IGenreRepository _genreRepository;
 
         public GenreManager(IGenreRepository genreRepository)
-        {
-            _genreRepository = genreRepository;
-        }
+        {}
 
         public async Task<List<GenreModel>> Create(Genre genre)

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/GenreManager.cs:26:22
         public async Task<List<GenreModel>> Create(Genre genre)
         {
 
-            var ok = _genreRepository
-              .GetAll()
-              .Where(x => x.Name == genre.Name).FirstOrDefault();
+            var ok = _genreRepository
+              .GetAll()
+              .Where(x => x.Name == genre.Name).First();
 
             if (ok == null)

[NoCoverage] Equality mutation
Managers/GenreManager.cs:28:27
 
             var ok = _genreRepository
               .GetAll()
-              .Where(x => x.Name == genre.Name).FirstOrDefault();
+              .Where(x => x.Name != genre.Name).FirstOrDefault();
 
             if (ok == null)

[NoCoverage] Statement mutation
Managers/GenreManager.cs:31:17
               .Where(x => x.Name == genre.Name).FirstOrDefault();
 
             if (ok == null)
-                await _genreRepository.Create(genre);
+                ;
 
             var cat = await GetAll();

[NoCoverage] Equality mutation
Managers/GenreManager.cs:40:82
         public async Task<List<GenreModel>> Update(Genre categ)
         {
 
-            var genre = await _genreRepository.GetAll().FirstOrDefaultAsync(x => x.Id == categ.Id);
+            var genre = await _genreRepository.GetAll().FirstOrDefaultAsync(x => x.Id != categ.Id);
 
             genre.Name = categ.Name;

[NoCoverage] Statement mutation
Managers/GenreManager.cs:43:13
             var genre = await _genreRepository.GetAll().FirstOrDefaultAsync(x => x.Id == categ.Id);
 
             genre.Name = categ.Name;
-            await _genreRepository.Update(genre);
+            ;
 
             var cat = await GetAll();

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Managers/GenreManager.cs:52:49
         public async Task<List<GenreModel>> DeleteNotUsedGenres()
         {
             var genreNotUsed = await _genreRepository.GetAll()
-                                    .Where(x => !x.SongGenres.Any())
+                                    .Where(x => x.SongGenres.Any())
                                     .ToListAsync();
 

[NoCoverage] Statement mutation
Managers/GenreManager.cs:56:17
                                     .ToListAsync();
 
             foreach (var genre in genreNotUsed)
-                await _genreRepository.Delete(genre);
+                ;
 
             var cat = await GetAll();

[NoCoverage] Object initializer mutation
Managers/GenreManager.cs:66:30
         {
             var genres = await _genreRepository
                 .GetAll()
-                .Select(x => new GenreModel
-                {
-                    Id = x.Id,
-                    Name = x.Name
-                })
+                .Select(x => new GenreModel
+{})
                 .ToListAsync();
 
