[Killed] Block removal mutation
Managers/SongCartManager.cs:20:9
         private readonly ISongCartRepository _songCartRepository;
 
         public SongCartManager(ISongCartRepository songCartRepository)
-        {
-            _songCartRepository = songCartRepository;
-        }
+        {}
 
         public async Task AddToSongCart(int songId, string email)

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/SongCartManager.cs:26:28
 
         public async Task AddToSongCart(int songId, string email)
         {
-            var songCart = _songCartRepository.GetAllSongCartsIncludeCarts()
-                .Where(x => x.SongId == songId && x.Cart.UserEmail == email && x.Cart.Sent == 0).FirstOrDefault();
+            var songCart = _songCartRepository.GetAllSongCartsIncludeCarts()
+                .Where(x => x.SongId == songId && x.Cart.UserEmail == email && x.Cart.Sent == 0).First();
 
             if (songCart == null)

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:27:51
         public async Task AddToSongCart(int songId, string email)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCarts()
-                .Where(x => x.SongId == songId && x.Cart.UserEmail == email && x.Cart.Sent == 0).FirstOrDefault();
+                .Where(x => x.SongId == songId && x.Cart.UserEmail != email && x.Cart.Sent == 0).FirstOrDefault();
 
             if (songCart == null)

[NoCoverage] Logical mutation
Managers/SongCartManager.cs:27:29
         public async Task AddToSongCart(int songId, string email)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCarts()
-                .Where(x => x.SongId == songId && x.Cart.UserEmail == email && x.Cart.Sent == 0).FirstOrDefault();
+                .Where(x => x.SongId == songId || x.Cart.UserEmail == email && x.Cart.Sent == 0).FirstOrDefault();
 
             if (songCart == null)

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:29:17
             var songCart = _songCartRepository.GetAllSongCartsIncludeCarts()
                 .Where(x => x.SongId == songId && x.Cart.UserEmail == email && x.Cart.Sent == 0).FirstOrDefault();
 
-            if (songCart == null)
+            if (songCart != null)
             {
                 var cartId = GetCartId(email);

[NoCoverage] Object initializer mutation
Managers/SongCartManager.cs:33:35
             {
                 var cartId = GetCartId(email);
 
-                var NewSongCart = new SongCart
-                {
-                    SongId = songId,
-                    CartId = cartId,
-                    NoCopies = 1
-                };
+                var NewSongCart = new SongCart
+{};
 
                 await _songCartRepository.CreateSongCart(NewSongCart);

[NoCoverage] Statement mutation
Managers/SongCartManager.cs:40:17
                     NoCopies = 1
                 };
 
-                await _songCartRepository.CreateSongCart(NewSongCart);
+                ;
             }
         }

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/SongCartManager.cs:46:28
 
         public async Task<List<SongCartModel>> IncreaseSongCart(SongCartModel songcart)
         {
-            var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0).FirstOrDefault();
+            var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
+                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0).First();
 
             songCart.NoCopies = songCart.NoCopies + 1;

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:47:61
         public async Task<List<SongCartModel>> IncreaseSongCart(SongCartModel songcart)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0).FirstOrDefault();
+                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id != songcart.CartId && x.Cart.Sent == 0).FirstOrDefault();
 
             songCart.NoCopies = songCart.NoCopies + 1;

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:47:93
         public async Task<List<SongCartModel>> IncreaseSongCart(SongCartModel songcart)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0).FirstOrDefault();
+                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent != 0).FirstOrDefault();
 
             songCart.NoCopies = songCart.NoCopies + 1;

[NoCoverage] Arithmetic mutation
Managers/SongCartManager.cs:49:33
             var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
                 .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0).FirstOrDefault();
 
-            songCart.NoCopies = songCart.NoCopies + 1;
+            songCart.NoCopies = songCart.NoCopies - 1;
 
             await _songCartRepository.UpdateSongCart(songCart);

[NoCoverage] Statement mutation
Managers/SongCartManager.cs:51:13
 
             songCart.NoCopies = songCart.NoCopies + 1;
 
-            await _songCartRepository.UpdateSongCart(songCart);
+            ;
 
             var newSongCart =  GetSongCartForUser(songCart.Cart.UserEmail, 0);

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/SongCartManager.cs:59:26
 
         public int GetCartId(string email)
         {
-            var idCart = _songCartRepository
-                .GetAllCarts()
-                .Where(x => x.UserEmail == email && x.Sent == 0)
-                .Select(x => x.Id)
-                .FirstOrDefault();
+            var idCart = _songCartRepository
+                .GetAllCarts()
+                .Where(x => x.UserEmail == email && x.Sent == 0)
+                .Select(x => x.Id)
+                .First();
 
             return idCart;

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:61:29
         {
             var idCart = _songCartRepository
                 .GetAllCarts()
-                .Where(x => x.UserEmail == email && x.Sent == 0)
+                .Where(x => x.UserEmail != email && x.Sent == 0)
                 .Select(x => x.Id)
                 .FirstOrDefault();

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:61:53
         {
             var idCart = _songCartRepository
                 .GetAllCarts()
-                .Where(x => x.UserEmail == email && x.Sent == 0)
+                .Where(x => x.UserEmail == email && x.Sent != 0)
                 .Select(x => x.Id)
                 .FirstOrDefault();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Managers/SongCartManager.cs:70:28
 
         public async Task<List<SongCartModel>> DecreaseSongCart(SongCartModel songcart)
         {
-            var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
-                .FirstOrDefault();
+            var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
+                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
+                .First();
 
             if (songCart.NoCopies - 1 > 0)

[NoCoverage] Logical mutation
Managers/SongCartManager.cs:71:29
         public async Task<List<SongCartModel>> DecreaseSongCart(SongCartModel songcart)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
+                .Where(x => x.Song.Id == songcart.SongId || x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
                 .FirstOrDefault();
 

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:71:29
         public async Task<List<SongCartModel>> DecreaseSongCart(SongCartModel songcart)
         {
             var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
+                .Where(x => x.Song.Id != songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
                 .FirstOrDefault();
 

[NoCoverage] Arithmetic mutation
Managers/SongCartManager.cs:74:17
                 .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
                 .FirstOrDefault();
 
-            if (songCart.NoCopies - 1 > 0)
+            if (songCart.NoCopies + 1 > 0)
             {
                 songCart.NoCopies = songCart.NoCopies - 1;

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:74:17
                 .Where(x => x.Song.Id == songcart.SongId && x.Cart.Id == songcart.CartId && x.Cart.Sent == 0)
                 .FirstOrDefault();
 
-            if (songCart.NoCopies - 1 > 0)
+            if (songCart.NoCopies - 1 >= 0)
             {
                 songCart.NoCopies = songCart.NoCopies - 1;

[NoCoverage] Arithmetic mutation
Managers/SongCartManager.cs:76:37
 
             if (songCart.NoCopies - 1 > 0)
             {
-                songCart.NoCopies = songCart.NoCopies - 1;
+                songCart.NoCopies = songCart.NoCopies + 1;
                 await _songCartRepository.UpdateSongCart(songCart);
             }

[NoCoverage] Statement mutation
Managers/SongCartManager.cs:77:17
             if (songCart.NoCopies - 1 > 0)
             {
                 songCart.NoCopies = songCart.NoCopies - 1;
-                await _songCartRepository.UpdateSongCart(songCart);
+                ;
             }
             else

[NoCoverage] Statement mutation
Managers/SongCartManager.cs:80:17
                 await _songCartRepository.UpdateSongCart(songCart);
             }
             else
-                await _songCartRepository.Delete(songCart);
+                ;
 
             var newSongCart = GetSongCartForUser(songCart.Cart.UserEmail, 0);

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:91:29
         {
             var cart = await _songCartRepository
                 .GetAllSongCartsIncludeCarts()
-                .Where(x => x.Cart.UserEmail == email && x.Cart.Sent == 0).ToListAsync();
+                .Where(x => x.Cart.UserEmail != email && x.Cart.Sent == 0).ToListAsync();
 
             foreach (var comanda in cart)

[NoCoverage] Equality mutation
Managers/SongCartManager.cs:91:58
         {
             var cart = await _songCartRepository
                 .GetAllSongCartsIncludeCarts()
-                .Where(x => x.Cart.UserEmail == email && x.Cart.Sent == 0).ToListAsync();
+                .Where(x => x.Cart.UserEmail == email && x.Cart.Sent != 0).ToListAsync();
 
             foreach (var comanda in cart)

[NoCoverage] Statement mutation
Managers/SongCartManager.cs:95:17
 
             foreach (var comanda in cart)
             {
-                await _songCartRepository.Delete(comanda);
+                ;
             }
         }

[Killed] Negate expression
Managers/SongCartManager.cs:101:17
 
         public List<SongCartModel> GetSongCartForUser(string email, int sent)
         {
-            if (sent == 0 || sent == 1)
+            if (!(sent == 0 || sent == 1))
             {
                 var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
killedBy: RecordShopTest.FunctionalTest.GetSongCartForUserValidTest; RecordShopTest.FunctionalTest.GetSongCartForUserValidTest

[Killed] Equality mutation
Managers/SongCartManager.cs:101:30
 
         public List<SongCartModel> GetSongCartForUser(string email, int sent)
         {
-            if (sent == 0 || sent == 1)
+            if (sent == 0 || sent != 1)
             {
                 var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
killedBy: RecordShopTest.FunctionalTest.GetSongCartForUserValidTest; RecordShopTest.FunctionalTest.GetSongCartForUserValidTest

[Killed] Logical mutation
Managers/SongCartManager.cs:104:33
             if (sent == 0 || sent == 1)
             {
                 var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                    .Where(x => x.Cart.UserEmail == email && x.Cart.Sent == sent)
+                    .Where(x => x.Cart.UserEmail == email || x.Cart.Sent == sent)
                     .Select(x => new SongCartModel
                     {

[Killed] Equality mutation
Managers/SongCartManager.cs:104:33
             if (sent == 0 || sent == 1)
             {
                 var songCart = _songCartRepository.GetAllSongCartsIncludeCartsAndSongs()
-                    .Where(x => x.Cart.UserEmail == email && x.Cart.Sent == sent)
+                    .Where(x => x.Cart.UserEmail != email && x.Cart.Sent == sent)
                     .Select(x => new SongCartModel
                     {

[Timeout] Arithmetic mutation
Managers/SongCartManager.cs:112:43
                         Name = x.Song.Name,
                         Price = x.Song.Price,
                         NoCopiesInCart = x.NoCopies,
-                        PriceOfNoCopies = x.Song.Price * x.NoCopies
+                        PriceOfNoCopies = x.Song.Price / x.NoCopies
                     })
                     .ToList();

[Killed] Equality mutation
Managers/SongCartManager.cs:116:21
                     })
                     .ToList();
 
-                if (songCart.Count() == 0)
+                if (songCart.Count() != 0)
                     return null;
 

[Timeout] Block removal mutation
Managers/SongCartManager.cs:122:13
                 return songCart;
             }
             else
-            {
-                return null;
-            }
+            {}
         }
 
