[Timeout] Block removal mutation
Managers/SongManager.cs:20:9
         private readonly ISongRepository _songRepository;
 
         public SongManager(ISongRepository songRepository)
-        {
-            _songRepository = songRepository;
-        }
+        {}
 
         public async Task<List<SongModel>> Create(Song song)

[NoCoverage] Statement mutation
Managers/SongManager.cs:26:13
 
         public async Task<List<SongModel>> Create(Song song)
         {
-            await _songRepository.Create(song);
+            ;
 
             var newList = await GetAllSongs();

[NoCoverage] Statement mutation
Managers/SongManager.cs:34:13
 
         public async Task<List<SongModel>> Update(Song song)
         {
-            await _songRepository.Update(song);
+            ;
 
             var newList = await GetAllSongs();

[NoCoverage] Statement mutation
Managers/SongManager.cs:42:13
 
         public async Task<List<SongModel>> Delete(Song song)
         {
-            await _songRepository.Delete(song);
+            ;
 
             var newList = await GetAllSongs();

[NoCoverage] Equality mutation
Managers/SongManager.cs:52:29
         {
             var songs = await _songRepository
                 .GetSongsWithGenre()
-                .Where(x => x.Genre.Name == genre)
+                .Where(x => x.Genre.Name != genre)
                 .Select(x => new SongModel
                 {

[NoCoverage] Equality mutation
Managers/SongManager.cs:72:29
         {
             var songs = await _songRepository
                 .GetSongsWithArtist()
-                .Where(x => x.Artist.Id == idArtist)
+                .Where(x => x.Artist.Id != idArtist)
                 .Select(x => new SongModel
                 {

[Timeout] Equality mutation
Managers/SongManager.cs:89:17
 
         public async Task<List<SongModel>> GetSongsByFilters(int idArtist, int minPrice, int maxPrice)
         {
-            if (minPrice <= 0)
+            if (minPrice > 0)
             {
                 throw new Exception("No negative prices!");

[Timeout] Equality mutation
Managers/SongManager.cs:89:17
 
         public async Task<List<SongModel>> GetSongsByFilters(int idArtist, int minPrice, int maxPrice)
         {
-            if (minPrice <= 0)
+            if (minPrice < 0)
             {
                 throw new Exception("No negative prices!");

[Timeout] Statement mutation
Managers/SongManager.cs:91:17
         {
             if (minPrice <= 0)
             {
-                throw new Exception("No negative prices!");
+                ;
             }
 

[Timeout] String mutation
Managers/SongManager.cs:91:37
         {
             if (minPrice <= 0)
             {
-                throw new Exception("No negative prices!");
+                throw new Exception("");
             }
 

[Timeout] Negate expression
Managers/SongManager.cs:94:17
                 throw new Exception("No negative prices!");
             }
 
-            if (maxPrice <= 0)
+            if (!(maxPrice <= 0))
             {
                 throw new Exception("No negative prices!");

[Timeout] Equality mutation
Managers/SongManager.cs:94:17
                 throw new Exception("No negative prices!");
             }
 
-            if (maxPrice <= 0)
+            if (maxPrice > 0)
             {
                 throw new Exception("No negative prices!");

[Timeout] Equality mutation
Managers/SongManager.cs:99:17
                 throw new Exception("No negative prices!");
             }
 
-            if (maxPrice <= minPrice)
+            if (maxPrice > minPrice)
             {
                 throw new Exception("Minimum price must be lower than maximum price!");

[Timeout] Equality mutation
Managers/SongManager.cs:99:17
                 throw new Exception("No negative prices!");
             }
 
-            if (maxPrice <= minPrice)
+            if (maxPrice < minPrice)
             {
                 throw new Exception("Minimum price must be lower than maximum price!");

[Timeout] Statement mutation
Managers/SongManager.cs:101:17
 
             if (maxPrice <= minPrice)
             {
-                throw new Exception("Minimum price must be lower than maximum price!");
+                ;
             }
 

[Timeout] String mutation
Managers/SongManager.cs:101:37
 
             if (maxPrice <= minPrice)
             {
-                throw new Exception("Minimum price must be lower than maximum price!");
+                throw new Exception("");
             }
 

[Timeout] Equality mutation
Managers/SongManager.cs:104:17
                 throw new Exception("Minimum price must be lower than maximum price!");
             }
 
-            if (idArtist <= 0)
+            if (idArtist < 0)
             {
                 throw new Exception("Must be chosen an artist!");

[Timeout] Equality mutation
Managers/SongManager.cs:104:17
                 throw new Exception("Minimum price must be lower than maximum price!");
             }
 
-            if (idArtist <= 0)
+            if (idArtist > 0)
             {
                 throw new Exception("Must be chosen an artist!");

[Timeout] Statement mutation
Managers/SongManager.cs:106:17
 
             if (idArtist <= 0)
             {
-                throw new Exception("Must be chosen an artist!");
+                ;
             }
 

[Timeout] Equality mutation
Managers/SongManager.cs:110:29
             }
 
             var songs = await _songRepository.GetSongsWithArtist()
-                .Where(x => x.Artist.Id == idArtist && x.Price >= minPrice && x.Price <= maxPrice)
+                .Where(x => x.Artist.Id != idArtist && x.Price >= minPrice && x.Price <= maxPrice)
                 .Select(x => new SongModel
                 {

[Timeout] Equality mutation
Managers/SongManager.cs:110:79
             }
 
             var songs = await _songRepository.GetSongsWithArtist()
-                .Where(x => x.Artist.Id == idArtist && x.Price >= minPrice && x.Price <= maxPrice)
+                .Where(x => x.Artist.Id == idArtist && x.Price >= minPrice && x.Price > maxPrice)
                 .Select(x => new SongModel
                 {

[Timeout] Equality mutation
Managers/SongManager.cs:123:17
                 })
                 .ToListAsync();
 
-            if (songs.Count() == 0)
+            if (songs.Count() != 0)
                 return null;
             

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Managers/SongManager.cs:131:31
 
         public async Task<List<SongModel>> GetAllSongs()
         {
-            var songs = await _songRepository.GetSongs()
-                .Select(x => new SongModel
-                {
-                    Id = x.Id,
-                    Name = x.Name,
-                    Price = x.Price,
-                    Duration = x.Duration,
-                    Year = x.Year,
-                    Remix = x.Remix,
-                    Album = x.Album
-                })
-                .OrderBy(x => x.Name)
-                .ToListAsync();
+            var songs = await _songRepository.GetSongs()
+                .Select(x => new SongModel
+                {
+                    Id = x.Id,
+                    Name = x.Name,
+                    Price = x.Price,
+                    Duration = x.Duration,
+                    Year = x.Year,
+                    Remix = x.Remix,
+                    Album = x.Album
+                })
+                .OrderByDescending(x => x.Name)
+                .ToListAsync();
             return songs;
         }

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
Managers/SongManager.cs:149:33
 
         public async Task<List<NoSongsWithGenreModel>> GetGroupBy()
         {
-            var grouped = await _songRepository.GetSongsWithGenre()
-                .GroupBy(x => x.Genre.Name)
-                .Select(x => new NoSongsWithGenreModel
-                {
-                    Name = x.Key,
-                    Num = x.Count()
-                })
-                .OrderByDescending(x => x.Num)
-                .ToListAsync();
+            var grouped = await _songRepository.GetSongsWithGenre()
+                .GroupBy(x => x.Genre.Name)
+                .Select(x => new NoSongsWithGenreModel
+                {
+                    Name = x.Key,
+                    Num = x.Count()
+                })
+                .OrderBy(x => x.Num)
+                .ToListAsync();
 
             return grouped;
